In [1]:
import pandas as pd

In [3]:
df=pd.read_csv("titanic.csv")

In [4]:
df.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
df.loc[0,"Ticket"] # loc ile kolon adı ve satır numarası ile ilgili değeri getiririz.

'A/5 21171'

In [6]:
df.loc[0,"Fare"]

7.25

In [7]:
df.loc[1,"Ticket"]

'PC 17599'

In [8]:
df.iloc[0,7]

'A/5 21171'

<code>loc</code> ve <code>iloc</code> ile bir dataframe içerisinden slicing ile yeni bir dataframe yaratılabilir.

In [12]:
new_df_loc=df.loc[0:2,"Ticket":"Cabin"]

In [14]:
new_df

             Ticket     Fare Cabin
0         A/5 21171   7.2500   NaN
1          PC 17599  71.2833   C85
2  STON/O2. 3101282   7.9250   NaN

In [15]:
new_df_iloc=df.iloc[5:7,3:9]

In [16]:
new_df_iloc

    Sex   Age  SibSp  Parch  Ticket     Fare
5  male   NaN      0      0  330877   8.4583
6  male  54.0      0      0   17463  51.8625

In [18]:
df.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,male,35.0,0,0,373450,8.0500,NaN,S

In [20]:
df["Age"]>=25

0      False
1       True
2       True
3       True
4       True
       ...
886     True
887    False
888    False
889     True
890     True
Name: Age, Length: 891, dtype: bool

In [21]:
new_df_up25=df[df["Age"]>=25] # sadece yaşı 25'e eşit ve büyük olan yolculardan oluşan bir veri seti oluşturduk.

In [22]:
new_df_up25.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,male,35.0,0,0,373450,8.0500,NaN,S
6,7,0,1,male,54.0,0,0,17463,51.8625,E46,S

In [23]:
df_gapminder=pd.read_csv("gapminder.csv")

In [24]:
df_gapminder.head()

   Unnamed: 0      country  year  population      cont  life_exp       gdp_cap
0          11  Afghanistan  2007  31889923.0      Asia    43.828    974.580338
1          23      Albania  2007   3600523.0    Europe    76.423   5937.029526
2          35      Algeria  2007  33333216.0    Africa    72.301   6223.367465
3          47       Angola  2007  12420476.0    Africa    42.731   4797.231267
4          59    Argentina  2007  40301927.0  Americas    75.320  12779.379640

In [27]:
df_gapminder["cont"]

0          Asia
1        Europe
2        Africa
3        Africa
4      Americas
         ...
137        Asia
138        Asia
139        Asia
140      Africa
141      Africa
Name: cont, Length: 142, dtype: object

In [31]:
# Bu kolonda kaç tane uniq değer olduğunu bulmak için unique metodunu kullanabiliriz.
df_gapminder["cont"].unique()

array(['Asia', 'Europe', 'Africa', 'Americas', 'Oceania'], dtype=object)

In [32]:
# Read data from CSV file

csv_path = 'https://s3-api.us-geo.objectstorage.softlayer.net/cf-courses-data/CognitiveClass/PY0101EN/Chapter%204/Datasets/TopSellingAlbums.csv'
df = pd.read_csv(csv_path)

In [33]:
df.head()

,Artist,Album,Released,Length,Genre,Music Recording Sales (millions),Claimed Sales (millions),Released.1,Soundtrack,Rating
0,Michael Jackson,Thriller,1982,0:42:19,"pop, rock, R&B",46.0,65,30-Nov-82,NaN,10.0
1,AC/DC,Back in Black,1980,0:42:11,hard rock,26.1,50,25-Jul-80,NaN,9.5
2,Pink Floyd,The Dark Side of the Moon,1973,0:42:49,progressive rock,24.2,45,01-Mar-73,NaN,9.0
3,Whitney Houston,The Bodyguard,1992,0:57:44,"R&B, soul, pop",27.4,44,17-Nov-92,Y,8.5
4,Meat Loaf,Bat Out of Hell,1977,0:46:33,"hard rock, progressive rock",20.6,43,21-Oct-77,NaN,8.0

In [34]:
# Read data from Excel File and print the first five rows

xlsx_path = 'https://s3-api.us-geo.objectstorage.softlayer.net/cf-courses-data/CognitiveClass/PY0101EN/Chapter%204/Datasets/TopSellingAlbums.xlsx'

df = pd.read_excel(xlsx_path)
df.head()

,Artist,Album,Released,Length,Genre,Music Recording Sales (millions),Claimed Sales (millions),Released.1,Soundtrack,Rating
0,Michael Jackson,Thriller,1982,00:42:19,"pop, rock, R&B",46.0,65,1982-11-30,NaN,10.0
1,AC/DC,Back in Black,1980,00:42:11,hard rock,26.1,50,1980-07-25,NaN,9.5
2,Pink Floyd,The Dark Side of the Moon,1973,00:42:49,progressive rock,24.2,45,1973-03-01,NaN,9.0
3,Whitney Houston,The Bodyguard,1992,00:57:44,"R&B, soul, pop",27.4,44,1992-11-17,Y,8.5
4,Meat Loaf,Bat Out of Hell,1977,00:46:33,"hard rock, progressive rock",20.6,43,1977-10-21,NaN,8.0

In [42]:
# Access to the column Length

x_df = df[['Length']]# İç içe iki köşeli parantez ile slicing yapılırsa dataframe oluşur.
x_df

     Length
0  00:42:19
1  00:42:11
2  00:42:49
3  00:57:44
4  00:46:33
5  00:43:08
6  01:15:54
7  00:40:01

In [47]:
x_sr = df['Length'] # Bu şekilde bir seri yaratılır
x_sr

0    00:42:19
1    00:42:11
2    00:42:49
3    00:57:44
4    00:46:33
5    00:43:08
6    01:15:54
7    00:40:01
Name: Length, dtype: object

In [46]:
print("x_df: ",type(x_df))
print("x_sr: ",type(x_sr))

x_df:  <class 'pandas.core.frame.DataFrame'>
x_sr:  <class 'pandas.core.series.Series'>

In [37]:
df[["Artist","Album","Genre"]]

,Artist,Album,Genre
0,Michael Jackson,Thriller,"pop, rock, R&B"
1,AC/DC,Back in Black,hard rock
2,Pink Floyd,The Dark Side of the Moon,progressive rock
3,Whitney Houston,The Bodyguard,"R&B, soul, pop"
4,Meat Loaf,Bat Out of Hell,"hard rock, progressive rock"
5,Eagles,Their Greatest Hits (1971-1975),"rock, soft rock, folk rock"
6,Bee Gees,Saturday Night Fever,disco
7,Fleetwood Mac,Rumours,soft rock